abdulmajeed90/lm3s2110-power-control/source/wave.c
/*
 * wave.c - 2013年07月22日 15时21分44秒
 *
 * Copyright (c) 2013, chenchacha
 * 
 */
#include <string.h>
#include "hw_ints.h"
#include "hw_memmap.h"
#include "hw_types.h"
#include "src/sysctl.h"
#include "src/debug.h"
#include "src/interrupt.h"
#include "src/sysctl.h"
#include "src/timer.h"
#include "src/gpio.h"
#include "src/pwm.h"
#include "src/pin_map.h"

#include "wave.h"
#include "system/sys_timer.h"
#include "system/sys_pwm.h"
#include "data/spwm.h"

/* #define PHASE 100
 */
#define PHASE 0
#define SPWM_DATA_BUFFER_DEEPIN 2048
unsigned char spwm_a[SPWM_DATA_BUFFER_DEEPIN] = {0};
unsigned char spwm_b[SPWM_DATA_BUFFER_DEEPIN] = {0};
/* unsigned char spwm_step=12; */
/* unsigned char spwm_step=24; */
unsigned char spwm_step=8;
/* unsigned char spwm_step=3;
 */
unsigned char spwm_value=0xf;
unsigned char spwm_flag=0;
unsigned int spwm_count_u=10;
unsigned int spwm_count_d=10;
int spwm_phase_a=PHASE;
int spwm_phase_b=PHASE;
void pwm_spwm_handler(void)
{
	PWMGenIntClear(PWM_BASE, PWM_GEN_0, PWM_INT_GEN_0);

	/* Output the switch wave */
	if (spwm_flag) {
			PWM_OD;
	} else {
			PWM_OU;
	}

	/* 	IntDisable(INT_PWM0);
	*/
	PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, spwm_value);
}

unsigned int spwm_reset=0;
void time_spwm_handler(void)
{
	static unsigned int wave_flag=1;
	static unsigned int i=0, j=0;

	TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

	if (spwm_reset == 1) {
		i=j=0;
		spwm_reset=0;
		wave_flag=1;
/* 		spwm_phase_a = PHASE;
 * 		spwm_phase_b = PHASE;
 */
	}

	/* Positive and negative */
	if (wave_flag) {
		spwm_value=spwm_a[i]+0x1;
		i+=spwm_step;
		spwm_flag=1;
	} else {
		spwm_value=spwm_b[j]+0x1;
		j+=spwm_step;
		spwm_flag=0;
	}

	if (i > (SPWM_DATA_BUFFER_DEEPIN/2)) {
		i = 0;
		/* Enable pwm interrupt for switch wave */
		/* 		IntEnable(INT_PWM0); */
		/* Output negative period */
		wave_flag=0;
	}
	if (j > (SPWM_DATA_BUFFER_DEEPIN)/2) {
		j=0;
		/* Enable pwm interrupt for switch wave */
		/* 		IntEnable(INT_PWM0); */
		/* Output postive period */
		wave_flag=1;
		/* Close timer */
		TimerDisable(TIMER2_BASE, TIMER_A);

		/* Reloade wave phase */
		spwm_phase_a = PHASE;
		spwm_phase_b = PHASE;
	}
}

/* In the positive, the PWM0 is low, the PWM1 is high */
/* #define PWM_POSITIVE_CLOSE	do {	\
 * 				GPIOPinWrite(PWM0_PORT, PWM0_PIN, 0x00);	\
 * 				GPIOPinWrite(PWM1_PORT, PWM1_PIN, 0xff);	\
 * 				GPIOPinTypeGPIOOutput(PWM0_PORT, PWM0_PIN);	\
 * 				GPIOPinTypeGPIOOutput(PWM1_PORT, PWM1_PIN);	 } while (0)
 */
#define PWM_POSITIVE_CLOSE	do{									\
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, 0xff);	\
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_1, 0xff);	\
				} while (0)


/* In the positive, the PWM0 is high, the PWM1 is low */
/* #define PWM_NEGATIVE_CLOSE	do {	\
 * 				GPIOPinWrite(PWM0_PORT, PWM0_PIN, 0xff);	\
 * 				GPIOPinWrite(PWM1_PORT, PWM1_PIN, 0x00);	\
 * 				GPIOPinTypeGPIOOutput(PWM0_PORT, PWM0_PIN);	\
 * 				GPIOPinTypeGPIOOutput(PWM1_PORT, PWM1_PIN);	} while (0)
 */
#define PWM_NEGATIVE_CLOSE	do{									\
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, 0xff);	\
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_1, 0xff);	\
				} while (0)

/* timer_spwm_double_handler -
 */
unsigned int temp_spwm_counter;
/* #define SPWM_STEP	16
 */
void timer_spwm_double_handler(void)
{
	static unsigned int i=0;
	static unsigned int temp_spwm_counter_step=60;
	static int nflag=0;

	TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

/* 	if (spwm_reset == 1) {
 * 		temp_spwm_counter=i;
 * 		temp_spwm_counter_step=i/SPWM_STEP;
 * 		i=0;
 * 		spwm_reset=0;
 * 	}
 */
#if 0

	PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, spwm_a[i]);
	PWMPulseWidthSet(PWM_BASE, PWM_OUT_1, spwm_b[SPWM_DATA_BUFFER_DEEPIN-1-i]);

#else
	/*
	 * The channel switch
	 */
	/* Positive */
/* 	if (i < SPWM_DATA_BUFFER_DEEPIN/2) {
 */
#if 0
	if (WAVE_SCAN) {
		/* if new period */
		if (nflag == 1) {
			nflag = 0;
			temp_spwm_counter=i;
			temp_spwm_counter_step=i/SPWM_STEP;
			i=0;
		}
		/* Configure switch level
		 * P0 low and P1 high.
		 */
		switch (i%SPWM_STEP) {
			/* P0 P1 high */
			/* P0 and P1 low(...) */
			case 0: 
			case 2: 
				GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
				break;
			case 4:
/* 				if (i>(SPWM_STEP/2+1)*temp_spwm_counter_step - temp_spwm_counter_step/2 &&
 * 						i<(SPWM_STEP-1)*temp_spwm_counter_step + temp_spwm_counter_step/2) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
			case 6:
				if (i>(SPWM_STEP/2+1)*temp_spwm_counter_step &&
						i<(SPWM_STEP-1)*temp_spwm_counter_step) {
					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
				}
				break;

			case 8:
/* 				if (i>(SPWM_STEP/2+2)*temp_spwm_counter_step - temp_spwm_counter_step/2 &&
 * 						i<(SPWM_STEP-2)*temp_spwm_counter_step + temp_spwm_counter_step/2) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
			case 10:
/* 				if (i>(SPWM_STEP/2+2)*temp_spwm_counter_step && i<(SPWM_STEP-2)*temp_spwm_counter_step) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
				if (i>(SPWM_STEP/2+1)*temp_spwm_counter_step &&
						i<(SPWM_STEP-1)*temp_spwm_counter_step) {
					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
				}

			case 12:
/* 				if (i>(SPWM_STEP/2+3)*temp_spwm_counter_step - temp_spwm_counter_step/2 &&
 * 						i<(SPWM_STEP-3)*temp_spwm_counter_step + temp_spwm_counter_step/2) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
			case 14:
/* 				if (i>(SPWM_STEP/2+3)*temp_spwm_counter_step && i<(SPWM_STEP-3)*temp_spwm_counter_step) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 					break;
 * 				}
 */
				if (i>(SPWM_STEP/2+2)*temp_spwm_counter_step && i<(SPWM_STEP-2)*temp_spwm_counter_step) {
					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
				}
				break;

			/* free */
			case 1:
			case 3:
			case 5:
			case 7:
			case 9:
			case 11:
			case 13:
			case 15:
			default:
				GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, PWM1_PIN);
				break;
		}
	} else {	/* Negative */
		nflag = 1;
		/* Configure switch level
		 * P0 high and P1 low.
		 */
		switch (i%SPWM_STEP) {
			/* P1 high */
			/* P0 and P1 low(...) */
			case 0:
			case 2:
				GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
				break;
			case 4:
/* 				if (i>temp_spwm_counter_step - temp_spwm_counter_step/2 &&
 * 						i<(SPWM_STEP/2-1)*temp_spwm_counter_step + temp_spwm_counter_step/2) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
			case 6:
				if (i>temp_spwm_counter_step && i<(SPWM_STEP/2-1)*temp_spwm_counter_step) {
					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
				}
				break;

			case 8:
/* 				if (i>2*temp_spwm_counter_step - temp_spwm_counter_step/2 &&
 * 						i<(SPWM_STEP/2-2)*temp_spwm_counter_step + temp_spwm_counter_step/2) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
			case 10:
/* 				if (i>2*temp_spwm_counter_step && i<(SPWM_STEP/2-2)*temp_spwm_counter_step) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
				if (i>temp_spwm_counter_step && i<(SPWM_STEP/2-1)*temp_spwm_counter_step) {
					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
				}
				break;

