abdulmajeed90/lm3s2110-power-control/source/wave.c
			case 12:

/* 				if (i>3*temp_spwm_counter_step - temp_spwm_counter_step/2 &&
 * 						i<(SPWM_STEP/2-3)*temp_spwm_counter_step + temp_spwm_counter_step/2) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
			case 14:
/* 				if (i>3*temp_spwm_counter_step && i<(SPWM_STEP/2-3)*temp_spwm_counter_step) {
 * 					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
 * 				}
 * 				break;
 */
				if (i>(SPWM_STEP/2+2)*temp_spwm_counter_step && i<(SPWM_STEP-2)*temp_spwm_counter_step) {
					GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, 0x00);
				}
				break;

			 /* free */
			case 1:
			case 3:
			case 5:
			case 7:
			case 9:
			case 11:
			case 13:
			case 15:
			default:
				GPIOPinWrite(PWM0_PORT, PWM0_PIN | PWM1_PIN, PWM0_PIN);
				break;
		}
	}
#endif

#if 0
	/*
	 * The channel switch
	 */
	if (i < SPWM_DATA_BUFFER_DEEPIN/2) { /* Positive */
		/* Configure switch level in low */
		PWMGenConfigure(PWM_BASE, PWM_GEN_0,
 | PWM_GEN_MODE_NO_SYNC);
		switch (i/spwm_step%8) {
			case 0: /* P0 P1 */
/* 				GPIOPinTypePWM(PWM0_PORT, PWM0_PIN);
 * 				GPIOPinTypePWM(PWM1_PORT, PWM1_PIN);
 */
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, spwm_a[i]);
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_1, 230 - spwm_a[i]);
				break;
			case 1: /* x */
				PWM_POSITIVE_CLOSE;
				break;
			case 2: /* P1 */
/* 				GPIOPinTypePWM(PWM1_PORT, PWM1_PIN);
 */
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_1, 230 - spwm_a[i]);
				break;
			case 3: /* x */
				PWM_POSITIVE_CLOSE;
				break;
			case 4: /* x */
				PWM_POSITIVE_CLOSE;
				break;
			case 5: /* x */
				PWM_POSITIVE_CLOSE;
				break;
			case 6: /* P1 */
/* 				GPIOPinTypePWM(PWM1_PORT, PWM1_PIN);
 */
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_1, 230 - spwm_a[i]);
				break;
			case 7: /* x */
				PWM_POSITIVE_CLOSE;
				break;
		}
	} else {	/* Negative */
		/* Configure switch level in high */
		PWMGenConfigure(PWM_BASE, PWM_GEN_0,
				PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);
		switch (i/spwm_step%8) {
			case 0: /* P0 P1 */
/* 				GPIOPinTypePWM(PWM0_PORT, PWM0_PIN);
 * 				GPIOPinTypePWM(PWM1_PORT, PWM1_PIN);
 */
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, spwm_b[SPWM_DATA_BUFFER_DEEPIN-1-i]);
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_1, 230 - spwm_b[SPWM_DATA_BUFFER_DEEPIN-1-i]);
				break;
			case 1: /* x */
				PWM_NEGATIVE_CLOSE;
				break;
			case 2: /* P0 */
/* 				GPIOPinTypePWM(PWM0_PORT, PWM0_PIN);
 */
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, spwm_b[SPWM_DATA_BUFFER_DEEPIN-1-i]);
				break;
			case 3: /* x */
				PWM_NEGATIVE_CLOSE;
				break;
			case 4: /* x */
				PWM_NEGATIVE_CLOSE;
				break;
			case 5: /* x */
				PWM_NEGATIVE_CLOSE;
				break;
			case 6: /* P0 */
/* 				GPIOPinTypePWM(PWM0_PORT, PWM0_PIN);
 */
				PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, spwm_b[SPWM_DATA_BUFFER_DEEPIN-1-i]);
				break;
			case 7: /* x */
				PWM_NEGATIVE_CLOSE;
				break;
		}
	}
#endif
#endif

/* 	i+=spwm_step;
 */
	i++;

	if (i >= SPWM_DATA_BUFFER_DEEPIN) {
		i = 0;
	}
	/* Close timer */
/* 	TimerDisable(TIMER1_BASE, TIMER_A);
 */
}		/* -----  end of function timer_spwm_double_handler  ----- */

/* wave_spwm_load_data -
 */
#define SPWM_DATA_STEP	200
unsigned int spwm_amplitude;
unsigned int spwm_delay;
void wave_spwm_load_data(unsigned int amplitude, unsigned int delay)
{
	if (amplitude > SPWM_DATA_STEP)
		spwm_amplitude = SPWM_DATA_STEP;
	else
		spwm_amplitude = amplitude;

	if (delay > SPWM_DATA_BUFFER_DEEPIN)
		spwm_delay = SPWM_DATA_BUFFER_DEEPIN;
	else
		spwm_delay = delay;
}		/* -----  end of function wave_spwm_load_data  ----- */

/* wave_spwm_read_data -
 */
void wave_spwm_read_data(unsigned int *amplitude, unsigned int *delay)
{
	*amplitude = spwm_amplitude;
	*delay = spwm_delay;
}		/* -----  end of function wave_spwm_read_data  ----- */

/* wave_spwm_data - initialize the sin data with amplitude
 */
void wave_spwm_data(void)
{
	int n;
/* 
 * 	for (n=0; n < 512; n++) {
 * 		spwm_a[n+PHASE] = spwm_data[n]/amplitude;
 * 		spwm_a[(1023+PHASE)-n] = spwm_data[n]/amplitude;
 * 	}
 * 	for (n=0; n < 512; n++) {
 * 		spwm_b[n+PHASE] = 0xff - (spwm_data[n]/amplitude);
 * 		spwm_b[(1023+PHASE)-n] = 0xff - (spwm_data[n]/amplitude);
 * 	}
 * 	for (n=0; n<PHASE; n++) {
 * 		spwm_a[PHASE-1-n] = 0xff - (spwm_data[n]/amplitude);
 * 		spwm_b[PHASE-1-n] = spwm_data[n]/amplitude;
 * 	}
 */
	memset(spwm_a, 0, sizeof (spwm_a));

	for (n=0; n < 512; n++) {
		spwm_a[n] = spwm_data[n];
		spwm_a[(1023)-n] = spwm_data[n];
	}
	for (n=0; n < 512; n++) {
		spwm_b[n] = 0xff - (spwm_data[n]);
		spwm_b[(1023)-n] = 0xff - (spwm_data[n]);
	}
}		/* -----  end of function wave_spwm_data  ----- */

/* wave_spwm_double_data -
 */
/* #define WAVE_COMPLETE
 */
#define DEAD_WIDTH	5
void wave_spwm_double_data(void)
{
	int n;
	unsigned long tmp;

	memset(spwm_a, 0xff, sizeof (spwm_a));
	memset(spwm_b, 0xff, sizeof (spwm_b));

#ifdef	WAVE_COMPLETE
	/* The channel 1 data */
	for (n=0; n < 512; n++) {
		tmp = ((unsigned long)spwm_data[n] * spwm_amplitude) / SPWM_DATA_STEP / 2;
		spwm_a[n] = (unsigned char)tmp+0x7f;
		spwm_a[1023-n] = (unsigned char)tmp+0x7f;
		spwm_a[1024+n] = 0x7f-(unsigned char)tmp;
		spwm_a[2047-n] = 0x7f-(unsigned char)tmp;
	}
	/* The channel 2 data */
	for (n=0; n < 512; n++) {
		tmp = ((unsigned long)spwm_data[n] * spwm_amplitude) / SPWM_DATA_STEP / 2;
/* 		spwm_b[n+spwm_delay] = (unsigned char)tmp;
 * 		spwm_b[1023+spwm_delay-n] = (unsigned char)tmp;
 */
		spwm_b[n+spwm_delay] = (unsigned char)tmp+0x7f;
		spwm_b[1023+spwm_delay-n] = (unsigned char)tmp+0x7f;
		spwm_b[(1024+spwm_delay+n)%2048] = 0x7f-(unsigned char)tmp;
		spwm_b[(2047+spwm_delay-n)%2048] = 0x7f-(unsigned char)tmp;
	}
#else
	/* The channel 1 data */
	for (n=0; n < 512; n++) {
		tmp = ((unsigned long)spwm_data[n] * spwm_amplitude) / SPWM_DATA_STEP;
		if (n>DEAD_WIDTH) {
			spwm_a[n+spwm_delay] = (unsigned char)tmp;
			spwm_a[1023+spwm_delay-n] = (unsigned char)tmp;
		}
	}
	/* The channel 2 data */
	for (n=0; n < 512; n++) {
		tmp = ((unsigned long)spwm_data[n] * spwm_amplitude) / SPWM_DATA_STEP;
		if (n>DEAD_WIDTH) {
			spwm_b[n+spwm_delay] = (unsigned char)tmp;
			spwm_b[1023+spwm_delay-n] = (unsigned char)tmp;
		}
	}
#endif
}		/* -----  end of function wave_spwm_double_data  ----- */

/* wave_spwm_data_step - initialize the sin data with amplitude with step
 * The wave step is 64.
 */
void wave_spwm_data_step(void)
{
	int n;
	unsigned long tmp;

	for (n=0; n < 512; n++) {
		tmp = ((unsigned long)spwm_data[n] * spwm_amplitude) / SPWM_DATA_STEP;
		spwm_a[n] = (unsigned char)tmp;
		spwm_a[1023-n] = (unsigned char)tmp;
	}
	for (n=0; n < 512; n++) {
		tmp = 0xff - (((unsigned long)spwm_data[n] * spwm_amplitude) / SPWM_DATA_STEP);
		spwm_b[n] = (unsigned char)tmp;
		spwm_b[1023-n] = (unsigned char)tmp;
	}
}		/* -----  end of function wave_spwm_data_step  ----- */

/* wave_spwm - output a spwm
 */
void wave_spwm(void)
{
	PWM_t pwm1;

	/* sin wave data */
	wave_spwm_load_data(200, 0);
	wave_spwm_data();

