abdulmajeed90/lm3s2110-power-control/source/wave.c
	/* Configure for GPIO */
    SysCtlPeripheralEnable(PWM_PIN_PERIPH);
	GPIOPinTypeGPIOOutput(PWM_PORT, PWM_PIN);

	/* Configure pwm counter */
	pwm1.gpio_periph = PWM0_PERIPH;
	pwm1.gpio_base = PWM0_PORT;
	pwm1.gpio = PWM0_PIN;
	pwm1.gen = PWM_GEN_0;
	pwm1.config = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC;
	pwm1.period = 0xff;
	pwm1.width = pwm1.period / 2;
	pwm1.out = PWM_OUT_0;
	pwm1.outbit = PWM_OUT_0_BIT;
	/* Configure for pwm interrupt */
	pwm1.trig = PWM_INT_CNT_ZERO;
	pwm1.intergen = PWM_INT_GEN_0;
	pwm1.handler = pwm_spwm_handler;
	pwm1.interrupt = INT_PWM0;
	PWM_init(&pwm1);
	IntEnable(INT_PWM0);

	/* Configure the periority of interrupt */
/* 	IntPrioritySet(INT_PWM0, 3);
 */
	/*
	 * Initialize a timer to base wave
	 */

	/* Enable the peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);

	TIMER_t timer;
	timer.base = TIMER2_BASE;
	timer.ntimer = TIMER_A;
	timer.config = TIMER_CFG_32_BIT_PER;
/* 	timer.config = TIMER_CFG_A_CAP_TIME | TIMER_CFG_16_BIT_PAIR;
 */
	/* 50Hz */
	timer.value = 5800;
	timer.interrupt = INT_TIMER2A;
	timer.prescale = 0;
	timer.intermod = TIMER_TIMA_TIMEOUT;
	timer.handler = time_spwm_handler;
	TIMER_init(&timer);
	/* Configure the periority of interrupt */
	IntPrioritySet(INT_TIMER2A, 0);

	TimerEnable(timer.base, timer.ntimer);
}

/* wave_spwm_double_init - initialize double wave to bridge
 */
void wave_spwm_double_init(int delay)
{
#if 0
	PWM_t pwm1;
	PWM_t pwm2;

	/* Sin wave data */
/* 	wave_spwm_data(1);
 */
	wave_spwm_load_data(200, 0);
	wave_spwm_double_data();


	/* Configure pwm counter */
	pwm1.gpio_periph = PWM0_PERIPH;
	pwm1.gpio_base = PWM0_PORT;
	pwm1.gpio = PWM0_PIN;
	pwm1.gen = PWM_GEN_0;
	/* 1configure pwm1 */
	pwm1.config = PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC | PWM_GEN_MODE_GEN_SYNC_LOCAL;
	pwm1.period = 0xff;
	pwm1.width = pwm1.period / 2;
	pwm1.out = PWM_OUT_0;
	pwm1.outbit = PWM_OUT_0_BIT;
	pwm1.handler = 0;
	PWM_init(&pwm1);

	/* configure pwm2 */
	pwm2.gpio_periph = PWM1_PERIPH;
	pwm2.gpio_base = PWM1_PORT;
	pwm2.gpio = PWM1_PIN;
	pwm2.gen = PWM_GEN_1;
	pwm2.config = PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC | PWM_GEN_MODE_GEN_SYNC_LOCAL;
	pwm2.period = 0xff;
	pwm2.width = pwm2.period / 2;
	pwm2.out = PWM_OUT_1;
	pwm2.outbit = PWM_OUT_1_BIT;
	pwm2.handler = 0;
 	PWM_init(&pwm2);
#else
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    SysCtlPeripheralEnable(PWM0_PERIPH);
    SysCtlPeripheralEnable(PWM0_PERIPH);
	SysCtlPeripheralEnable(WAVE_INT_PPER);

	GPIOPinTypeGPIOOutput(PWM0_PORT, PWM0_PIN);
	GPIOPinTypeGPIOOutput(GPIO_PORTA_BASE, GPIO_PIN_5);
	GPIOPinTypeGPIOOutput(PWM1_PORT, PWM1_PIN);
	GPIOPinTypeGPIOInput(WAVE_INT_PBASE, WAVE_SCAN_PIN);
	
#endif

	/*
	 * Initialize a timer to base wave
	 */

	/* Enable the peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);

	TIMER_t timer;
	timer.base = TIMER2_BASE;
	timer.ntimer = TIMER_A;
	timer.config = TIMER_CFG_32_BIT_PER;
/* 	timer.config = TIMER_CFG_A_CAP_TIME | TIMER_CFG_16_BIT_PAIR;
 */
	/* 50Hz */
	timer.value = 580;
	timer.interrupt = INT_TIMER2A;
	timer.prescale = 0;
	timer.intermod = TIMER_TIMA_TIMEOUT;
	timer.handler = timer_spwm_double_handler;
	TIMER_init(&timer);
	/* Configure the periority of interrupt */
	IntPrioritySet(INT_TIMER2A, 0);

	TimerEnable(timer.base, timer.ntimer);
}		/* -----  end of function wave_spwm_double_init  ----- */

/* wave_spwm_load - load the timer interrupt value
 */
void wave_spwm_load(unsigned long value)
{
	TimerLoadSet(TIMER2_BASE, TIMER_A, value);
}		/* -----  end of function wave_spwm_load  ----- */

/* wave_pwm - output two pwm
*/
void wave_pwm(unsigned long period1, unsigned long period2)
{
	PWM_t pwm1;
	int count = SysCtlClockGet();

	/* Configure pwm counter */
	pwm1.gpio_periph = PWM0_PERIPH;
	pwm1.gpio_base = PWM0_PORT;
	pwm1.gpio = PWM0_PIN;
	pwm1.gen = PWM_GEN_0;
/* 	pwm1.config = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC;
 */
	/* configure pwm1 */
	pwm1.config = PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC;
	pwm1.period = count / period1;
	pwm1.width = pwm1.period / 3;
	pwm1.out = PWM_OUT_0;
	pwm1.outbit = PWM_OUT_0_BIT;
	pwm1.handler = 0;
	PWM_init(&pwm1);

#if 0
	pwm1.gpio_periph = SYSCTL_PERIPH_GPIOD;
	pwm1.gpio_base = GPIO_PORTD_BASE;
	pwm1.gpio = GPIO_PIN_1;
	pwm1.gen = PWM_GEN_1;
	pwm1.config = PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC;
	pwm1.period = count / period2;
	pwm1.width = pwm1.period / 2;
	pwm1.out = PWM_OUT_1;
	pwm1.outbit = PWM_OUT_1_BIT;
	pwm1.handler = 0;
	PWM_init(&pwm1);

	/* configure pwm2 */
	pwm2.gpio_periph = SYSCTL_PERIPH_GPIOB;
	pwm2.gpio_base = GPIO_PORTB_BASE;
	pwm2.gpio = GPIO_PIN_0;
	pwm2.gen = PWM_GEN_2;
	pwm2.config = PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC;
	pwm2.period = count / period2;
	pwm2.width = pwm2.period / 2;
	pwm2.out = PWM_OUT_2;
	pwm2.outbit = PWM_OUT_2_BIT;
	pwm2.handler = 0;
 	PWM_init(&pwm2);
#endif
}		/* -----  end of function wave_pwm  ----- */

/* wave_pwm_value - pwm load period value
 */
void wave_pwm_value(unsigned long value)
{
	PWMGenPeriodSet(PWM_BASE, PWM_GEN_0, value);
    PWMPulseWidthSet(PWM_BASE, PWM_GEN_0, value>>1);
}		/* -----  end of function wave_pwm_value  ----- */

/* wave_pwm_get_value -
*/
unsigned long wave_pwm_get_value(void)
{
	return PWMGenPeriodGet(PWM_BASE, PWM_GEN_0);
}		/* -----  end of function wave_pwm_get_value  ----- */

/* wave_capture - wave capture by timer
 * @capture_handler: the handler function for capture.
 * enable timer0 channel A and CCP0(PA0).
 * capture all of edges. both positive edges and negative edges.
 */
void wave_capture(void (*capture_handler)(void))
{
	TIMER_t timer;

	/* Enable the peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
    SysCtlPeripheralEnable(CCP0_PERIPH);
	/* Set GPIO B0 as an output */
	GPIOPinTypeTimer(CCP0_PORT, CCP0_PIN);

	/* Configure timer structure */
	timer.base = TIMER0_BASE;
	timer.ntimer = TIMER_A;
	/* Timer A event timer and Two 16-bit timers */
	timer.config = TIMER_CFG_A_CAP_TIME | TIMER_CFG_16_BIT_PAIR;
	timer.event_config = TIMER_EVENT_BOTH_EDGES;
	timer.value = 0xffff;
	timer.interrupt = INT_TIMER0A;
	timer.prescale = 0;
	/* CaptureA event interrupt */
	timer.intermod = TIMER_CAPA_EVENT;
	timer.handler = capture_handler;
	TIMER_init(&timer);

