abdulmajeed90/lm3s2110-power-control/source/wave.c
	TimerEnable(timer.base, timer.ntimer);
}		/* -----  end of function wave_capture  ----- */

/* wave_capture_32 - wave capture by timer
 * @capture_handler: the handler function for capture.
 * enable timer0 channel A and CCP0(PA0).
 * capture all of edges. both positive edges and negative edges.
 */
void wave_cap32(void (*capture_handler)(void))
{
	TIMER_t timer;

	/* Enable the peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
    SysCtlPeripheralEnable(WAVE_32_PERIPH);
	/* Configure GPIO in input */
	GPIOPinTypeGPIOInput(WAVE_32_PORT, WAVE_32_PIN);
	/* Configure interrupt type */
	GPIOIntTypeSet(WAVE_32_PORT, WAVE_32_PIN, GPIO_BOTH_EDGES);

	/* Register the interrupt handler */
	GPIOPortIntRegister(WAVE_32_PORT, capture_handler);
	/* Enable the pin interrupt */
	GPIOPinIntEnable(WAVE_32_PORT, WAVE_32_PIN);

	/* Configure timer structure */
	timer.base = TIMER0_BASE;
	timer.ntimer = TIMER_A;
	timer.config = TIMER_CFG_32_BIT_PER;
	timer.value = 0xffffffff;
	timer.event_config = 0xffffffff;
	timer.prescale = 0;
	timer.handler = 0;
	TIMER_init(&timer);

	/* Enable the port interrupt */
	TimerEnable(timer.base, timer.ntimer);
	IntEnable(WAVE_32_INT);
}		/* -----  end of function wave_capture  ----- */

/* wave_cap32_load - load the timer interrupt value
 */
void wave_cap32_load(unsigned long value)
{
	TimerLoadSet(TIMER0_BASE, TIMER_A, value);
}		/* -----  end of function wave_cap32_load  ----- */

/* wave_cap32_start - start counter
 */
void wave_cap32_start(void)
{
	TimerEnable(TIMER0_BASE, TIMER_A);
}		/* -----  end of function wave_cap32_start  ----- */

/* wave_cap32_stop -
 */
void wave_cap32_stop(void)
{
	TimerDisable(TIMER0_BASE, TIMER_A);
}		/* -----  end of function wave_cap32_stop  ----- */

/* wave_cap32_getvalue -
 */
unsigned long wave_cap32_getvalue(void)
{
	return (0xffffffff - TimerValueGet(TIMER0_BASE, TIMER_A));
}		/* -----  end of function wave_cap32_getvalue  ----- */

/* wave_cap32_clean -
 */
void wave_cap32_clean(void)
{
	unsigned int status;

	status = GPIOPinIntStatus(WAVE_32_PORT, true);
	GPIOPinIntClear(WAVE_32_PORT, status);
}		/* -----  end of function wave_cap32_clean  ----- */

/* wave_interrupt_init - enable a timer interrupt
 * @value: the count value.
 * @wave_handler: the handler function for capture.
 */
void wave_interrupt_init(unsigned long value, void (*wave_handler)(void))
{
	/* Enable the peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER1);

	TIMER_t timer;
	timer.base = TIMER1_BASE;
	timer.ntimer = TIMER_A;
	timer.config = TIMER_CFG_32_BIT_PER;
	timer.value = value;
	timer.interrupt = INT_TIMER1A;
	timer.prescale = 0;
	timer.intermod = TIMER_TIMA_TIMEOUT;
	timer.handler = wave_handler;
	TIMER_init(&timer);

	/* Eable output pin */
	SysCtlPeripheralEnable(WAVE_INT_PPER);
	GPIOPinTypeGPIOOutput(WAVE_INT_PBASE, WAVE_INT_PIN);
	GPIOPinTypeGPIOInput(WAVE_INT_PBASE, WAVE_SCAN_PIN);

	GPIOPinWrite(GPIO_PORTD_BASE, WAVE_INT_PIN, 0);
}		/* -----  end of function wave_interrupt_init  ----- */

/* wave_interrupt_load - load the timer interrupt value
 */
void wave_interrupt_load(unsigned long value)
{
	TimerLoadSet(TIMER1_BASE, TIMER_A, value);
}		/* -----  end of function wave_interrupt_load  ----- */

/* wave_interrupt_start - start counter
 */
void wave_interrupt_start(void)
{
	TimerEnable(TIMER1_BASE, TIMER_A);
}		/* -----  end of function wave_interrupt_start  ----- */

/* wave_interrupt_stop -
 */
void wave_interrupt_stop(void)
{
	TimerDisable(TIMER1_BASE, TIMER_A);
}		/* -----  end of function wave_interrupt_stop  ----- */

/* wave_interrupt_clean -
 */
void wave_interrupt_clean(void)
{
	TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
}		/* -----  end of function wave_interrupt_clean  ----- */
